Revit 2026 API

# SaveAsOptionsSetWorksharingOptions Method

---

Sets Worksharing options for SaveAs.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetWorksharingOptions(
	WorksharingSaveAsOptions worksharingOptions
)
```
```vb
Public Sub SetWorksharingOptions (
	worksharingOptions As WorksharingSaveAsOptions
)
```
```cpp
public:
void SetWorksharingOptions(
	WorksharingSaveAsOptions^ worksharingOptions
)
```
```fsharp
member SetWorksharingOptions :
        worksharingOptions : WorksharingSaveAsOptions -> unit
```

#### Parameters

worksharingOptions WorksharingSaveAsOptions

Must be  for a non-workshared model.

Allowed to be  for a workshared model, in which case default values for WorksharingSaveAsOptions are used.

#### Reference

SaveAsOptions Class

Autodesk.Revit.DB Namespace